In [3]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
import datetime

In [4]:
ufo_df = pd.read_csv('../data/nuforc.csv')
ufo_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148451 entries, 0 to 148450
Data columns (total 11 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   Unnamed: 0  148451 non-null  int64
 1   image_link  148451 non-null  object
 2   occurred    148153 non-null  object
 3   city        147920 non-null  object
 4   state       139495 non-null  object
 5   country     148451 non-null  object
 6   shape       142108 non-null  object
 7   summary     148377 non-null  object
 8   reported    148451 non-null  object
 9   posted      148451 non-null  object
 10  image       4277 non-null    object
dtypes: int64(1), object(10)
memory usage: 12.5+ MB

In [5]:
ufo_df['country'].nunique()

395

In [6]:
ufo_df['country'].value_counts()

USA                       132522
Canada                      5938
United Kingdom              3437
Australia                    952
India                        488
                           ...
Dominica, West Indies          1
sri lanka                      1
Caribbean (Grand Turk)         1
italy                          1
Germany/France                 1
Name: country, Length: 395, dtype: int64

In [7]:
ufo_df['city'].nunique()

30237

In [8]:
usa_ufos = ufo_df[ufo_df['country'] == 'USA']

In [9]:
us_city_counts = usa_ufos[['city', 'state']].value_counts()
us_city_counts = pd.DataFrame(us_city_counts).reset_index()
us_city_counts.columns = ['city', 'state', 'count']

us_city_counts.sort_values('count', ascending=False)
us_city_counts.head(10)

          city state  count
0      Phoenix    AZ    773
1      Seattle    WA    742
2    Las Vegas    NV    648
3     Portland    OR    590
4  Los Angeles    CA    557
5    San Diego    CA    547
6       Tucson    AZ    472
7      Chicago    IL    446
8      Houston    TX    429
9  Albuquerque    NM    399

explored the 'state' field

In [10]:
usa_ufos[['state']].nunique()

state    61
dtype: int64

In [11]:
usa_ufos.state.unique()

array(['KY', 'SC', 'VA', 'CT', 'NH', 'CA', 'MA', 'ME', 'PA', 'NJ', 'OH',
       'NY', 'MD', 'IN', 'FL', 'WI', 'MI', 'AR', 'CO', 'IL', 'OR', 'AK',
       'NV', 'TX', 'UT', 'NC', 'TN', 'VT', 'WA', 'MS', 'WV', 'NE', 'OK',
       'NM', 'AZ', 'AL', 'ID', 'MT', 'MN', 'MO', 'LA', 'GA', 'IA', 'WY',
       'KS', 'DE', 'SD', 'RI', 'HI', '-', '0', 'ND', 'PR', 'DC', 'VI',
       'Fl', 'West Virginia', 'NB', 'GU', 'Ca', 'UM'], dtype=object)

began cleaning 'state' field. I checked to see if any of the territories were typos of states before removing.

In [12]:
usa_ufos[usa_ufos['state'] == 'GU']

,Unnamed: 0,image_link,occurred,city,state,country,shape,summary,reported,posted,image
45779,45779,<a data-content='Open' href='/sighting/?id=120...,7/13/2015 2:00,Inarajan (Guam),GU,USA,Light,Orange glowing light in sky that responded to ...,7/13/2015,7/17/2015,NaN
52715,52715,<a data-content='Open' href='/sighting/?id=177...,8/1/2014 17:59,Agana,GU,USA,Orb,Orange light orbs floating low.,8/1/2023,9/10/2023,NaN
142238,62238,<a data-content='Open' href='/sighting/?id=166...,5/1/1980 20:30,Inarajan (Guam),GU,USA,Circle,On a evening of May 19,2/7/2022,3/4/2022,NaN

In [13]:
usa_ufos = usa_ufos[usa_ufos['state'] != 'GU']

In [14]:
usa_ufos.state.unique()

array(['KY', 'SC', 'VA', 'CT', 'NH', 'CA', 'MA', 'ME', 'PA', 'NJ', 'OH',
       'NY', 'MD', 'IN', 'FL', 'WI', 'MI', 'AR', 'CO', 'IL', 'OR', 'AK',
       'NV', 'TX', 'UT', 'NC', 'TN', 'VT', 'WA', 'MS', 'WV', 'NE', 'OK',
       'NM', 'AZ', 'AL', 'ID', 'MT', 'MN', 'MO', 'LA', 'GA', 'IA', 'WY',
       'KS', 'DE', 'SD', 'RI', 'HI', '-', '0', 'ND', 'PR', 'DC', 'VI',
       'Fl', 'West Virginia', 'NB', 'Ca', 'UM'], dtype=object)

In [15]:
usa_ufos[usa_ufos['state'] == 'VI']

,Unnamed: 0,image_link,occurred,city,state,country,shape,summary,reported,posted,image
10028,10028,<a data-content='Open' href='/sighting/?id=165...,12/8/2021 17:30,Frederikste (Virgin Islands),VI,USA,Chevron,Triangle shapes moved very slowly to the north.,12/8/2021,12/19/2021,NaN
10551,10551,<a data-content='Open' href='/sighting/?id=165...,10/26/2021 11:00,Frederiksted St> Croix USVI,VI,USA,Oval,Noticed an image in a picture when looking at ...,12/7/2021,12/19/2021,Y
14328,14328,<a data-content='Open' href='/sighting/?id=160...,11/5/2020 5:45,Charlotte Amalie,VI,USA,Light,Eleven stars moving and then disappearing,11/4/2020,12/23/2020,NaN
20668,20668,<a data-content='Open' href='/sighting/?id=152...,1/12/2020 17:59,St. Thomas (USVI),VI,USA,Sphere,UFO seen above the US Virgin Islands.,1/28/2020,2/7/2020,NaN
49027,49027,<a data-content='Open' href='/sighting/?id=116...,12/31/2014 23:59,St. Thomas (U. S. Virgin Islands),VI,USA,Triangle,Red triangle seen over us Virgin Islands on Ne...,1/8/2015,1/9/2015,NaN
57009,57009,<a data-content='Open' href='/sighting/?id=106...,2/6/2014 3:45,St. Thomas (U. S. Virgin Islands),VI,USA,Cylinder,Saw the ufo and it was obvious that it was ext...,2/6/2014,2/7/2014,NaN
68203,68203,<a data-content='Open' href='/sighting/?id=928...,9/17/2012 21:35,Kingshill (U. S. Virgin Islands),VI,USA,Fireball,Greenish blue fireball seen racing across the ...,9/17/2012,9/24/2012,NaN
78951,78951,<a data-content='Open' href='/sighting/?id=803...,3/5/2011 20:00,Charlotte Amalie (U. S. Virgin Islands),VI,USA,Fireball,Bright flare up object durring twilight,3/6/2011,3/10/2011,NaN
84243,4243,<a data-content='Open' href='/sighting/?id=741...,1/23/2010 0:00,Cruz Bay (U. S. Virgin Islands),VI,USA,Light,Four bright amber coloured lights spotted flyi...,1/23/2010,2/14/2010,NaN
94533,14533,<a data-content='Open' href='/sighting/?id=610...,1/21/2008 22:00,U. S. Virgin Islands (Cruz Bay),VI,USA,Light,Every night I see this object in the sky from ...,1/21/2008,2/14/2008,NaN
101648,21648,<a data-content='Open' href='/sighting/?id=166...,7/29/2006 22:00,St. Croix (Virgin Islands),VI,USA,Light,Erratic ball of light,2/8/2022,3/4/2022,NaN
108468,28468,<a data-content='Open' href='/sighting/?id=457...,12/22/2004 7:55,"Frederiksted (St. Croix, US Virgin Islands)",VI,USA,Flash,Streaks of light moving quickly and erraticall...,8/22/2005,9/2/2005,NaN
113820,33820,<a data-content='Open' href='/sighting/?id=331...,11/13/2003 21:30,Atlantic Ocean (Virgin Islands),VI,USA,Rectangle,A bright Orange Object appeared to be observin...,11/16/2003,11/26/2003,NaN
132572,52572,<a data-content='Open' href='/sighting/?id=575...,7/1/1998 1:00,St. Thomas (U. S. Virgin Islands),VI,USA,NaN,craft from st thomas,7/10/2007,8/7/2007,NaN
133585,53585,<a data-content='Open' href='/sighting/?id=307...,10/25/1997 22:00,"St. Thomas, (U. S. Virgin Islands)",VI,USA,Orb,Was staring at a very clear night sky over the...,2/1/1998,3/7/1998,NaN
136097,56097,<a data-content='Open' href='/sighting/?id=751...,11/10/1995 23:00,St. Thomas (Charlotte Amalie) (U. S. Virgin Is...,VI,USA,Circle,A LARGE MOON SIZE ILUMINATED GLOBE,4/19/2010,5/12/2010,NaN
141441,61441,<a data-content='Open' href='/sighting/?id=287...,4/20/1983 21:00,St. Croix (U. S. Virgin Islands),VI,USA,Light,A HUGE LIGHT FLOATING OVER OUR HOUSE IN THE VI...,5/14/2003,5/27/2003,NaN
143051,63051,<a data-content='Open' href='/sighting/?id=536...,2/15/1978 10:00,St.Thomas (U. S. Virgin Islands),VI,USA,Disk,Visible in the mid-day,11/25/2006,12/7/2006,NaN
146304,66304,<a data-content='Open' href='/sighting/?id=177...,4/1/1967 21:00,St. Croix,VI,USA,Circle,A bright white sphere seen in the night sky,8/1/2023,9/10/2023,NaN

In [16]:
usa_ufos = usa_ufos[usa_ufos['state'] != 'VI'] 
usa_ufos = usa_ufos[usa_ufos['state'] != 'PR'] 
#| (usa_ufos['state'] != '') 
usa_ufos.state.unique()

array(['KY', 'SC', 'VA', 'CT', 'NH', 'CA', 'MA', 'ME', 'PA', 'NJ', 'OH',
       'NY', 'MD', 'IN', 'FL', 'WI', 'MI', 'AR', 'CO', 'IL', 'OR', 'AK',
       'NV', 'TX', 'UT', 'NC', 'TN', 'VT', 'WA', 'MS', 'WV', 'NE', 'OK',
       'NM', 'AZ', 'AL', 'ID', 'MT', 'MN', 'MO', 'LA', 'GA', 'IA', 'WY',
       'KS', 'DE', 'SD', 'RI', 'HI', '-', '0', 'ND', 'DC', 'Fl',
       'West Virginia', 'NB', 'Ca', 'UM'], dtype=object)

In [17]:
usa_ufos[usa_ufos['state'] == 'NB']

,Unnamed: 0,image_link,occurred,city,state,country,shape,summary,reported,posted,image
42776,42776,<a data-content='Open' href='/sighting/?id=124...,11/13/2015 22:30,Omaha,NB,USA,NaN,My bf and I noticed in the sky a craft that wa...,11/14/2015,11/19/2015,NaN

In [18]:
usa_ufos[usa_ufos['state'] == 'UM']
usa_ufos = usa_ufos[usa_ufos['state'] != 'UM']

In [19]:
usa_ufos[usa_ufos['state'] == 'Fl']

,Unnamed: 0,image_link,occurred,city,state,country,shape,summary,reported,posted,image
28232,28232,<a data-content='Open' href='/sighting/?id=143...,10/4/2018 5:45,Largo,Fl,USA,Circle,"While looking at sky before sunrise, I saw a c...",10/6/2018,10/6/2018,NaN
135562,55562,<a data-content='Open' href='/sighting/?id=151...,5/26/1996 1:55,Fort Myers,Fl,USA,NaN,"Woman driving home from shopping sees ""subdued...",5/26/1996,11/2/1999,NaN
135570,55570,<a data-content='Open' href='/sighting/?id=151...,5/22/1996 20:30,Venice,Fl,USA,NaN,"Mother, 2 sons driving along wooded road, see ...",5/22/1996,11/2/1999,NaN
135583,55583,<a data-content='Open' href='/sighting/?id=150...,5/17/1996 1:30,Miami,Fl,USA,NaN,"Man sees aqua-green obj., with bright orange n...",5/16/1996,11/2/1999,NaN
135644,55644,<a data-content='Open' href='/sighting/?id=144...,4/28/1996 0:10,Fort Walton Beach,Fl,USA,NaN,"Capt., 4x crew, witness VERY bright descend fr...",4/28/1996,11/2/1999,NaN

In [20]:
usa_ufos['state'] = usa_ufos['state'].replace('Fl', 'FL')
usa_ufos['state'] = usa_ufos['state'].replace('NB', 'NE')
usa_ufos['state'] = usa_ufos['state'].replace('Ca', 'CA')
usa_ufos['state'] = usa_ufos['state'].replace('West Virginia', 'WV')
usa_ufos['state'] = usa_ufos['state'].replace('-', 'Unknown')
usa_ufos['state'] = usa_ufos['state'].replace('0', 'Unknown')

In [21]:
usa_ufos.state.unique()

array(['KY', 'SC', 'VA', 'CT', 'NH', 'CA', 'MA', 'ME', 'PA', 'NJ', 'OH',
       'NY', 'MD', 'IN', 'FL', 'WI', 'MI', 'AR', 'CO', 'IL', 'OR', 'AK',
       'NV', 'TX', 'UT', 'NC', 'TN', 'VT', 'WA', 'MS', 'WV', 'NE', 'OK',
       'NM', 'AZ', 'AL', 'ID', 'MT', 'MN', 'MO', 'LA', 'GA', 'IA', 'WY',
       'KS', 'DE', 'SD', 'RI', 'HI', 'Unknown', 'ND', 'DC'], dtype=object)

In [22]:
usa_ufos.state.nunique()

52

In [23]:
#usa_ufos.groupby(['state']).count()

In [24]:
usa_ufos[usa_ufos['state']=='CA'].city.nunique()

2564

exported to csv to clean 'city' field in Excel

In [25]:
# usa_ufos.to_csv('usa_ufos.csv')

imported cleaned csv

In [26]:
usa_ufos2 = pd.read_csv('../data/usa_ufos_clean2.csv', nrows = 132308,  encoding='unicode_escape')

In [27]:
usa_ufos2.head()

,occurred,city,state,country,shape,summary,reported,posted,image
0,2/15/2024 14:20,SHEPHERDSVILLE,KY,USA,ORB,Several sightings over several years.,2/15/2024,2/15/2024,NaN
1,2/15/2024 6:21,GREENVILLE,SC,USA,CIRCLE,"Object moving slowing across the sky, suddenly...",2/15/2024,2/15/2024,NaN
2,2/14/2024 22:45,UNKNOWN,VA,USA,LIGHT,Standing to the west of this object it hung in...,2/15/2024,2/15/2024,NaN
3,2/14/2024 22:44,SOMERS,CT,USA,UNKNOWN,"Odd, flashing object I could only describe dur...",2/14/2024,2/15/2024,Y
4,2/14/2024 22:15,BOSCAWEN,NH,USA,LIGHT,Bright light in sky changing shape but almost ...,2/15/2024,2/15/2024,Y

In [28]:
usa_ufos2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 132307 entries, 0 to 132306
Data columns (total 9 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   occurred  132069 non-null  object
 1   city      132304 non-null  object
 2   state     132307 non-null  object
 3   country   132307 non-null  object
 4   shape     126496 non-null  object
 5   summary   132238 non-null  object
 6   reported  132307 non-null  object
 7   posted    132307 non-null  object
 8   image     3669 non-null    object
dtypes: object(9)
memory usage: 9.1+ MB

In [29]:
usa_ufos2['state'].value_counts()
state_counts = usa_ufos2['state'].value_counts()
state_counts = pd.DataFrame(state_counts).reset_index()
state_counts.columns = ['state', 'count']
state_counts.head()

  state  count
0    CA  16243
1    FL   8305
2    WA   7233
3    TX   6203
4    NY   5908

In [30]:
usa_ufos2[usa_ufos2['state']=='CA'].city.nunique()

#previous result was 2564

1740

In [31]:
us_city_counts2 = usa_ufos2[['city', 'state']].value_counts()
us_city_counts2 = pd.DataFrame(us_city_counts2).reset_index()
us_city_counts2.columns = ['city', 'state', 'count']

#us_city_count2.sort_values('count', ascending=False)
us_city_counts2.nlargest(10, 'count')

#previous answers were
# 0 Phoenix	AZ	773
# 1	Seattle	WA	742
# 2	Las Vegas	NV	648
# 3	Portland	OR	590
# 4	Los Angeles	CA	557
# 5	San Diego	CA	547
# 6	Tucson	AZ	472
# 7	Chicago	IL	446
# 8	Houston	TX	429
# 9	Albuquerque	NM	399

#Note that NYC was not in top 10. Why the big change? 
# I made New York City (Brooklyn) and New York City (Manhattan) and New York City (Queens) all NYC

            city state  count
0        PHOENIX    AZ    822
1  NEW YORK CITY    NY    809
2        SEATTLE    WA    806
3      LAS VEGAS    NV    704
4    LOS ANGELES    CA    618
5       PORTLAND    OR    616
6      SAN DIEGO    CA    594
7         TUCSON    AZ    489
8        CHICAGO    IL    478
9        HOUSTON    TX    449

In [53]:
# set plot style: grey grid in the background:
# top10city = us_city_counts2.nlargest(10, 'count')
# sns.set(style="darkgrid")

# # Set the figure size
# plt.figure(figsize=(10, 7))

# # plot a bar chart
# ax = sns.barplot(
#     x=top10city["count"], 
#     y=top10city['city'], 
#     data=top10city, 
# #   estimator=sum, 
#     ci=None, 
#     color='#69b3a2');
# plt.title('CITIES MOST LIKELY TO SEE UFOS')
# plt.xlabel('Total Number of Sightings')
# ax.set(ylabel=None);

# plt.savefig('CITIES MOST LIKELY TO SEE UFOS')

In [33]:
cities_df = pd.read_csv('../data/uscities.csv')

joining with maps csv for lat & long fields

In [34]:
ufos_map_df = pd.merge(usa_ufos2, cities_df, on=['city','state'], how='left')

In [35]:
ufos_map_df.head()

,occurred,city,state,country,shape,summary,reported,posted,image,county_fips,...,lng,population,density,source,military,incorporated,timezone,ranking,zips,id
0,2/15/2024 14:20,SHEPHERDSVILLE,KY,USA,ORB,Several sightings over several years.,2/15/2024,2/15/2024,NaN,21029.0,...,-85.7007,14136.0,345.1,shape,False,True,America/New_York,3.0,40165 40166,1.840015e+09
1,2/15/2024 6:21,GREENVILLE,SC,USA,CIRCLE,"Object moving slowing across the sky, suddenly...",2/15/2024,2/15/2024,NaN,45045.0,...,-82.3646,401443.0,917.9,shape,False,True,America/New_York,2.0,29614 29607 29605 29601 29609 29602 29603 2960...,1.840014e+09
2,2/14/2024 22:45,UNKNOWN,VA,USA,LIGHT,Standing to the west of this object it hung in...,2/15/2024,2/15/2024,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2/14/2024 22:44,SOMERS,CT,USA,UNKNOWN,"Odd, flashing object I could only describe dur...",2/14/2024,2/15/2024,Y,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2/14/2024 22:15,BOSCAWEN,NH,USA,LIGHT,Bright light in sky changing shape but almost ...,2/15/2024,2/15/2024,Y,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [36]:
ufos_map_df['city_st'] = ufos_map_df['city'] + ', ' + ufos_map_df['state']
ufos_map_df.head()

,occurred,city,state,country,shape,summary,reported,posted,image,county_fips,...,population,density,source,military,incorporated,timezone,ranking,zips,id,city_st
0,2/15/2024 14:20,SHEPHERDSVILLE,KY,USA,ORB,Several sightings over several years.,2/15/2024,2/15/2024,NaN,21029.0,...,14136.0,345.1,shape,False,True,America/New_York,3.0,40165 40166,1.840015e+09,"SHEPHERDSVILLE, KY"
1,2/15/2024 6:21,GREENVILLE,SC,USA,CIRCLE,"Object moving slowing across the sky, suddenly...",2/15/2024,2/15/2024,NaN,45045.0,...,401443.0,917.9,shape,False,True,America/New_York,2.0,29614 29607 29605 29601 29609 29602 29603 2960...,1.840014e+09,"GREENVILLE, SC"
2,2/14/2024 22:45,UNKNOWN,VA,USA,LIGHT,Standing to the west of this object it hung in...,2/15/2024,2/15/2024,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"UNKNOWN, VA"
3,2/14/2024 22:44,SOMERS,CT,USA,UNKNOWN,"Odd, flashing object I could only describe dur...",2/14/2024,2/15/2024,Y,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"SOMERS, CT"
4,2/14/2024 22:15,BOSCAWEN,NH,USA,LIGHT,Bright light in sky changing shape but almost ...,2/15/2024,2/15/2024,Y,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"BOSCAWEN, NH"

new csv for mapping in Tableau

In [37]:
#ufos_map_df.to_csv('ufos_map_df.csv')

In [52]:
ufos_map_df['state'].value_counts()
state_counts = ufos_map_df['state'].value_counts()
state_counts = pd.DataFrame(state_counts).reset_index()
state_counts.columns = ['state', 'count']
state_counts.head()

  state  count
0    CA  16290
1    FL   8307
2    WA   7233
3    TX   6203
4    NY   5911

In [50]:
city_count= ufos_map_df[['city', 'state']].value_counts()
city_count = pd.DataFrame(city_count).reset_index()
city_count.columns = ['city', 'state', 'count']

# #us_city_count2.sort_values('count', ascending=False)
# us_city_counts2.nlargest(10, 'count')
city_count.head(10)

            city state  count
0        PHOENIX    AZ    822
1  NEW YORK CITY    NY    809
2        SEATTLE    WA    806
3      LAS VEGAS    NV    704
4    LOS ANGELES    CA    618
5       PORTLAND    OR    616
6      SAN DIEGO    CA    594
7         TUCSON    AZ    489
8        CHICAGO    IL    478
9        HOUSTON    TX    449

In [40]:
city_pop = ufos_map_df[['city', 'state', 'population', 'lat', 'lng']]
city_pop

                  city state  population      lat       lng
0       SHEPHERDSVILLE    KY     14136.0  37.9813  -85.7007
1           GREENVILLE    SC    401443.0  34.8354  -82.3646
2              UNKNOWN    VA         NaN      NaN       NaN
3               SOMERS    CT         NaN      NaN       NaN
4             BOSCAWEN    NH         NaN      NaN       NaN
...                ...   ...         ...      ...       ...
132440         MANNING    SC      3862.0  33.6933  -80.2167
132441         NAHUNTA    GA      1386.0  31.2065  -81.9814
132442       TREVORTON    PA      1695.0  40.7841  -76.6711
132443        RICHLAND    WA     60867.0  46.2824 -119.2939
132444   NEW YORK CITY    NY  18908608.0  40.6943  -73.9249

[132445 rows x 5 columns]

In [41]:
per_cap = pd.merge(city_count, city_pop, on=['city', 'state'], how='inner')
per_cap

                    city state  count  population      lat       lng
0                PHOENIX    AZ    822   4064275.0  33.5722 -112.0892
1                PHOENIX    AZ    822   4064275.0  33.5722 -112.0892
2                PHOENIX    AZ    822   4064275.0  33.5722 -112.0892
3                PHOENIX    AZ    822   4064275.0  33.5722 -112.0892
4                PHOENIX    AZ    822   4064275.0  33.5722 -112.0892
...                  ...   ...    ...         ...      ...       ...
132437  KELLY CROSSROADS    PA      1         NaN      NaN       NaN
132438     KELLYS ISLAND    OH      1         NaN      NaN       NaN
132439          KELLYTON    AL      1       179.0  32.9791  -86.0358
132440        KELLYVILLE    OK      1      1086.0  35.9528  -96.2003
132441            ZWOLLE    LA      1      1860.0  31.6398  -93.6412

[132442 rows x 6 columns]

In [42]:
per_cap = per_cap.drop_duplicates()
per_cap.dropna(subset=['population'], inplace=True)
per_cap

c:\Users\tkwhi\anaconda3\lib\site-packages\pandas\util\_decorators.py:311: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return func(*args, **kwargs)

                 city state  count  population      lat       lng
0             PHOENIX    AZ    822   4064275.0  33.5722 -112.0892
822     NEW YORK CITY    NY    809  18908608.0  40.6943  -73.9249
1631          SEATTLE    WA    806   3561397.0  47.6211 -122.3244
2437        LAS VEGAS    NV    704   2248047.0  36.2333 -115.2654
3141      LOS ANGELES    CA    618  11922389.0  34.1141 -118.4068
...               ...   ...    ...         ...      ...       ...
132434        KELLOGG    IA      1       635.0  41.7181  -92.9072
132435        KELLOGG    ID      1      2294.0  47.5371 -116.1420
132439       KELLYTON    AL      1       179.0  32.9791  -86.0358
132440     KELLYVILLE    OK      1      1086.0  35.9528  -96.2003
132441         ZWOLLE    LA      1      1860.0  31.6398  -93.6412

[13385 rows x 6 columns]

In [43]:
per_cap = per_cap[per_cap['population'] >0]
per_cap

                 city state  count  population      lat       lng
0             PHOENIX    AZ    822   4064275.0  33.5722 -112.0892
822     NEW YORK CITY    NY    809  18908608.0  40.6943  -73.9249
1631          SEATTLE    WA    806   3561397.0  47.6211 -122.3244
2437        LAS VEGAS    NV    704   2248047.0  36.2333 -115.2654
3141      LOS ANGELES    CA    618  11922389.0  34.1141 -118.4068
...               ...   ...    ...         ...      ...       ...
132434        KELLOGG    IA      1       635.0  41.7181  -92.9072
132435        KELLOGG    ID      1      2294.0  47.5371 -116.1420
132439       KELLYTON    AL      1       179.0  32.9791  -86.0358
132440     KELLYVILLE    OK      1      1086.0  35.9528  -96.2003
132441         ZWOLLE    LA      1      1860.0  31.6398  -93.6412

[13345 rows x 6 columns]

In [44]:
per_cap['per_capita'] = per_cap['count'] / per_cap['population']

C:\Users\tkwhi\AppData\Local\Temp/ipykernel_18312/1722143596.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  per_cap['per_capita'] = per_cap['count'] / per_cap['population']

In [45]:
per_cap.sort_values('per_capita', ascending=False)

,city,state,count,population,lat,lng,per_capita
88072,LAKE BUENA VISTA,FL,9,7.0,28.3790,-81.5262,1.285714
65334,RACHEL,NV,20,20.0,37.6414,-115.7681,1.000000
79146,TONOPAH,AZ,12,13.0,33.4880,-112.9308,0.923077
109803,GILBERT,AR,3,4.0,35.9905,-92.7166,0.750000
127706,CEDAR POINT,KS,1,2.0,38.2600,-96.8225,0.500000
...,...,...,...,...,...,...,...
87280,BRONX,NY,9,1472654.0,40.8501,-73.8662,0.000006
123054,SPRING VALLEY,NV,1,220114.0,36.0952,-115.2636,0.000005
99625,MANHATTAN,NY,6,1694263.0,40.7834,-73.9662,0.000004
90860,QUEENS,NY,8,2405464.0,40.7498,-73.7976,0.000003
124367,SAINTPAUL,MN,1,308806.0,44.9478,-93.1039,0.000003

In [46]:
per_cap_20 = per_cap.sort_values('per_capita', ascending=False)
per_cap_20 = per_cap_20.head(20)
per_cap_20 = per_cap_20[['city', 'state','per_capita']]
#per_cap_20.to_csv('per_cap_20.csv')

In [47]:
ten_percent = per_cap[per_cap['per_capita'] >.01]
ten_percent.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 688 entries, 28018 to 132419
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   city        688 non-null    object
 1   state       688 non-null    object
 2   count       688 non-null    int64
 3   population  688 non-null    float64
 4   lat         688 non-null    float64
 5   lng         688 non-null    float64
 6   per_capita  688 non-null    float64
dtypes: float64(4), int64(1), object(2)
memory usage: 43.0+ KB

In [48]:
# per_cap.to_csv('ufos_per_cap.csv')

from Martha transparent background

ax = sns.scatterplot(data=tn_food_access_df, x='pct_lalowi05_10', y='pct_no_vehicle', color="#721121")
sns.set_style("darkgrid", {"grid.color": "lightsteelblue", "grid.linestyle": ":"})
ax.patch.set_alpha(0.5)
plt.title('Vehicle Access and Low Food Access/Low Income')
plt.xlabel('Low Income/Access at 1/2 and 10 Miles (%)')
plt.ylabel('No Vehicle Access (%)')
# plt.savefig('vehicle_lalowi05_10.png', transparent=True)